tests/cases/voidCavitation/0/U
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);
boundaryField
{
    inlet
    {
        type            moldingInletVelocity;
        totalFlowRate   1e-07;
        gate            gate1;
        runner
        {
            inletTemperature 480;
            cp               2400;
            rho              800;
            viscosity { type powerLaw; K 1e4; n 0.5; }
            feed { length 0.05; diameter 0.004; }
            gates { gate1 { length 0.01; diameter 0.002; } }
        }
        value           uniform (0 0 0);
    }
    vent    { type moldingVentVelocity; value uniform (0 0 0); }
    walls   { type noSlip; }
}
