tests/cases/voidCavitation/0/p
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 1e5;
boundaryField
{
    ".*"    { type calculated; value $internalField; }
}
