tests/cases/voidCavitation/system/expectedPatterns
Selecting compressible::VoFCavitation
End
